Catalogs/упСтилиМаркеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСтилиМаркеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упКартинкиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЦвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеПривязкиX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеПривязкиY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Comment>Ширина изображения в пикселях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Comment>Высота изображения в пикселях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масштаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упСтилиМаркеров/Forms/ФормаОпределенияРазмераКартинки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	HTMLДокумент = Справочники.упСтилиМаркеров.ПолучитьМакет("HTML_ОпределениеРазмераКартинки").ПолучитьТекст();
	ИмяВременногоФайла = Параметры.ИмяФайла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИмяФайла = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ДлительнаяОперация48);
	HTMLДокумент = СтрЗаменить(HTMLДокумент, "%Картинка%", ИмяФайла);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура HTMLДокументДокументСформирован(Элемент)
	
	ПодключитьОбработчикОжидания("ОпределитьРазмерИзображения", 1, Истина);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте	
Процедура ОпределитьРазмерИзображения()

	ВыполнитьПроцедуруHTML("setImageDimention(""" + ИмяВременногоФайла + """)");
	ПодключитьОбработчикОжидания("УстановитьРазмерИзображения", 0.4, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРазмерИзображения()
	
	сткРазмеры = Новый Структура("Ширина, Высота", 0, 0);
	стрВозврат = ВыполнитьФункциюHTML("getImageDimention()");
	мсвРазмеры = СтрРазделить(стрВозврат, ";", Ложь);
	Если ТипЗнч(мсвРазмеры) = Тип("Массив") И мсвРазмеры.Количество() = 2 Тогда
		сткРазмеры.Ширина = мсвРазмеры[0];
		сткРазмеры.Высота = мсвРазмеры[1];
	КонецЕсли;

	Закрыть(сткРазмеры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроцедуруHTML(текстСкрипта)	
	
	Попытка
		Элементы.HTMLДокумент.Документ.parentWindow.eval(текстСкрипта);	
	Исключение
		ПоказатьОповещениеПользователя(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьФункциюHTML(текстСкрипта)
	
	Попытка
		Возврат Элементы.HTMLДокумент.Документ.parentWindow.eval(текстСкрипта);
	Исключение
		ПоказатьОповещениеПользователя(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат "";
	КонецПопытки;	
	
КонецФункции

#КонецОбласти
